## Staging: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.expired-email-created-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "expired-email-created-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Email inflights are expiring at > 200 for 5 minutes"
      + alarm_name                            = "expired-email-created-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 200
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "expired_email_created"
          + label       = "Expired email created"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "expired"           = "True"
                  + "notification_type" = "email"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
    }

  # aws_cloudwatch_metric_alarm.expired-email-created-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "expired-email-created-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Email inflights are expiring at > 100 for 5 minutes"
      + alarm_name                            = "expired-email-created-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "expired_email_created"
          + label       = "Expired Email created"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "expired"           = "True"
                  + "notification_type" = "email"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
    }

  # aws_cloudwatch_metric_alarm.expired-sms-created-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "expired-sms-created-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "SMS inflights are expiring at > 200 for 5 minutes"
      + alarm_name                            = "expired-sms-created-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 200
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "expired_sms_created"
          + label       = "Expired SMS created"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "expired"           = "True"
                  + "notification_type" = "sms"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
    }

  # aws_cloudwatch_metric_alarm.expired-sms-created-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "expired-sms-created-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "SMS inflights are expiring at > 100 for 5 minutes"
      + alarm_name                            = "expired-sms-created-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "expired_sms_created"
          + label       = "Expired SMS created"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "expired"           = "True"
                  + "notification_type" = "sms"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
